# RenderLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..RenderLevel Property
RenderingQualitySettings Class See Also
---
The render target level as a numerical value between 1 and 40.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int RenderLevel { get; set; }
```

Visual Basic
---
```text
Public Property RenderLevel As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int RenderLevel {
	int get ();
	void set (int value);
}
```

# Remarks
Increase this value to increase render level.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value is not valid for RenderLevel. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace